nc: 4  # number of classes
scales:   # [depth, width, max_channels]
  T: [0.33, 0.25, 1024] 


# backbone 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]   # 0-P2/4
  - [-1, 3, VSSBlock, [128]]               # 1
  - [-1, 1, VisionClueMerge, [256]]      # 2 p3/8
  - [-1, 3, VSSBlock_DSM, [256]]              # 3
  - [-1, 1, SEINBlock, [256]]           # 4
  - [-1, 1, VisionClueMerge, [512]]      # 5 p4/16
  - [-1, 9, VSSBlock_DSM, [512]]              # 6
  - [-1, 1, SEINBlock, [512]]        # 7
  - [-1, 1, VisionClueMerge, [1024]]      # 8 p5/32
  - [-1, 3, VSSBlock_DSM, [1024]]              # 9
  - [-1, 1, SEINBlock, [1024]]         # 10
  - [-1, 1, SPPF, [1024, 5]]               # 11

# PAFPN
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 7], 1, Concat, [1]]  # 13 cat backbone P4
  - [-1, 3, XSSBlock, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]  # 16  cat backbone P3
  - [-1, 3, XSSBlock, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 14], 1, Concat, [1]]  # 19  cat head P4
  - [-1, 3, XSSBlock, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 21
  - [[-1, 11], 1, Concat, [1]]  # 22    cat head P5
  - [-1, 3, XSSBlock, [1024]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # 24  Detect(P3, P4, P5)
